In [3]:
import pandas as pd

In [4]:
# create a path to the files
excel = 'test.xlsx'
csv = 'test.csv'

In [5]:
excel_data = pd.read_excel(excel)
excel_data

  Unnamed: 0  Kolom 1  Kolom 2  Kolom 3  Kolom 4
0      Rij 1        1        2        3        4
1      Rij 2        5        6        7        8
2      Rij 3        9       10       11       12

In [6]:
csv_data = pd.read_csv(csv)
csv_data

  Unnamed: 0  Kolom 1  Kolom 2  Kolom 3  Kolom 4
0      Rij 1        1        2        3        4
1      Rij 2        5        6        7        8
2      Rij 3        9       10       11       12

In [7]:
csv_data['Kolom 1']

0    1
1    5
2    9
Name: Kolom 1, dtype: int64

In [8]:
csv_data['Kolom 1'].mean

<bound method Series.mean of 0    1
1    5
2    9
Name: Kolom 1, dtype: int64>

In [9]:
csv_data.iloc[1]

Unnamed: 0    Rij 2
Kolom 1           5
Kolom 2           6
Kolom 3           7
Kolom 4           8
Name: 1, dtype: object

In [10]:
csv_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  3 non-null      object
 1   Kolom 1     3 non-null      int64
 2   Kolom 2     3 non-null      int64
 3   Kolom 3     3 non-null      int64
 4   Kolom 4     3 non-null      int64
dtypes: int64(4), object(1)
memory usage: 252.0+ bytes

In [12]:
# Create my own dataframe
something = ([1,2,3,4,5], ["Yes", "No", "Maybe", "Don't know", "What?"])

new_df = pd.DataFrame(something)

new_df.head()

     0   1      2           3      4
0    1   2      3           4      5
1  Yes  No  Maybe  Don't know  What?

In [62]:
# Create a list
new_list = [1, 2, 3, 4, 5, "something", False]

other_list = list( (1, 2, 3, 4, 5) )

# Create a Tuple
new_tuple = (1, 2, 3, 4, 5, "something", False)

other_tuple = tuple()

# Create a dictionary
new_dict = {
    "brand": "Ford",
    "model": "Mustang",
    "year": 1964
}

other_dict = dict(name="thijs",age=43,gender="male")

In [63]:
print(new_list)
print(other_list)

print(type(new_list))
print(type(other_list))

print(type(new_list[5])) # check the data type

print(new_tuple)
print(other_tuple)

print(type(new_tuple[5])) # check the data type


print(new_dict)
print(other_dict)

print(type(new_dict["year"])) # check the data type

[1, 2, 3, 4, 5, 'something', False]
[1, 2, 3, 4, 5]
<class 'list'>
<class 'list'>
<class 'str'>
(1, 2, 3, 4, 5, 'something', False)
()
<class 'str'>
{'brand': 'Ford', 'model': 'Mustang', 'year': 1964}
{'name': 'thijs', 'age': 43, 'gender': 'male'}
<class 'int'>

In [80]:
# Create Dataframe with list
list_df = pd.DataFrame(new_list)
# list_df

# Create Dataframe with tuple
tuple_df = pd.DataFrame(new_tuple)
# tuple_df

# Create Dataframe with dictonary
# dict_df = pd.DataFrame(new_dict) # This is not possible!

In [76]:
# Add and remove something from the list
newer_list = [1, 2, 3, 4, 5, "something", False]

newer_list.append( "8")

newer_list[0] = "yes"

print(newer_list)


# Add and remove something from the tupple

newer_tuple = (1, 2, 3, 4, 5, "something", False)

# newer_tuple.append("8") # this is not possible!

# newer_tuple[0] = "no" # you can't do this!

['yes', 2, 3, 4, 5, 'something', False, '8']

In [92]:
# Create a dictionary
# newest_dict = {
#     {
#         "brand": "Ford",
#         "model": "Mustang",
#         "year": 1964
#     },
#     {
#         "brand": "Citroen",
#         "model": "C3",
#         "year":  2020
#     }
# }

newest_dict = {
        "brand": ["Ford", "Peugeot", "Audi", "Volkswagen"],
        "model": ["Mustang", "A5"],
        "year": 1964
   
    }

newest_dict

for x, y in newest_dict.items():
    print(x, y)


newest_dict["brand"]

brand ['Ford', 'Peugeot', 'Audi', 'Volkswagen']
model ['Mustang', 'A5']
year 1964

['Ford', 'Peugeot', 'Audi', 'Volkswagen']

In [95]:
# Create a team in tuples
team = [
    ("Peter", "Bofkont", "Spits"),
    ("Jantje", "Sleungel", "Verdediger"),
    ("Bart", "Baller", "Keeper"),
]

team

[('Peter', 'Bofkont', 'Spits'),
 ('Jantje', 'Sleungel', 'Verdediger'),
 ('Bart', 'Baller', 'Keeper')]

In [102]:
nieuw_team = pd.DataFrame(team)
nieuw_team

        0         1           2
0   Peter   Bofkont       Spits
1  Jantje  Sleungel  Verdediger
2    Bart    Baller      Keeper

In [100]:
# Add column names to data frame
nieuw_team.columns =['first_name', 'last_name', 'position']

nieuw_team

  first_name last_name    position
0      Peter   Bofkont       Spits
1     Jantje  Sleungel  Verdediger
2       Bart    Baller      Keeper

In [105]:
b_team = [
    ("Peter", "Bofkont", "Spits"),
    ("Jantje", "Sleungel", "Verdediger"),
    ("Bart", "Baller", "Keeper"),
]


# Create a dict
nieuwste_team = {}

# for first_name, last_name, postion in b_team:
#     if position in nieuw_team:
#         nieuwste_team[position].append((first_name, last_name))
#     else:
#         nieuwste_team[position] = [(first_name, last_name)]
        

# nieuwste_team

In [113]:
# Work with boolean masking
some_data = {
    "planet": ["Mercury", "Venus", "Pluto", "Earth", "Mars"],
    "radius": [2324, 234523, 6745, 4643, 3523],
    "moons": [0, 3, 4, 13, 3]   
}

some_data

{'planet': ['Mercury', 'Venus', 'Pluto', 'Earth', 'Mars'],
 'radius': [2324, 234523, 6745, 4643, 3523],
 'moons': [0, 3, 4, 13, 3]}

In [114]:
planets = pd.DataFrame(some_data)
planets

    planet  radius  moons
0  Mercury    2324      0
1    Venus  234523      3
2    Pluto    6745      4
3    Earth    4643     13
4     Mars    3523      3

In [116]:
mask = planets['moons'] < 12
mask

0     True
1     True
2     True
3    False
4     True
Name: moons, dtype: bool

In [119]:
# Apply mask to data frame
moons_under_twelve = planets[mask]
moons_under_twelve

    planet  radius  moons
0  Mercury    2324      0
1    Venus  234523      3
2    Pluto    6745      4
4     Mars    3523      3

In [120]:
planets

    planet  radius  moons
0  Mercury    2324      0
1    Venus  234523      3
2    Pluto    6745      4
3    Earth    4643     13
4     Mars    3523      3

In [136]:
planet_research = pd.read_csv('planets.csv')
planet_research

    Planet     Radius  Moons  Temperature
0     Mars    3535435      2         23.0
1  Jupiter    3459543      6        214.0
2    Pluto       1239     10        436.0
3    Earth     325232     22         43.0
4   Saturn    3253205    100       3242.0
5   Uranus      94564  19222        356.0
6  Mercury  329283432     12       6546.0

In [139]:
planet_research.groupby('Temperature').sum()

              Planet     Radius  Moons
Temperature
23.0            Mars    3535435      2
43.0           Earth     325232     22
214.0        Jupiter    3459543      6
356.0         Uranus      94564  19222
436.0          Pluto       1239     10
3242.0        Saturn    3253205    100
6546.0       Mercury  329283432     12